{"knowledge": "Arthur's Magazine (1844–1846) was an American literary periodical published in Philadelphia in the 19th century.First for Women is a woman's magazine published by Bauer Media Group in the USA.", "question": "Which magazine was started first Arthur's Magazine or First for Women?", "right_answer": "Arthur's Magazine", "hallucinated_answer": "First for Women was started first."}
{"knowledge": "The Oberoi family is an Indian family that is famous for its involvement in hotels, namely through The Oberoi Group.The Oberoi Group is a hotel company with its head office in Delhi.", "question": "The Oberoi family is part of a hotel company that has a head office in what city?", "right_answer": "The Oberoi family's hotel company is based in Delhi.", "hallucinated_answer": "The Oberoi family's hotel company is based in Mumbai."}
{"knowledge": "Margaret \"Peggy\" Seeger (born June 17, 1935) is an American folksinger. She is also well known in Britain, where she has lived for more than 30 years, and was married to the singer and songwriter Ewan MacColl until his death in 1989.James Henry Miller (25 January 1915 – 22 October 1989), better known by his stage name Ewan MacColl, was an English folk singer, songwriter, communist, labour activist, actor, poet, playwright and record producer.", "question": " What nationality was James Henry Miller's wife?", "right_answer": "James Henry Miller's wife was American", "hallucinated_answer": "James Henry Miller's wife was British."}
{"knowledge": " It is a hygroscopic solid that is highly soluble in water and slightly soluble in alcohol.Ethanol, also called alcohol, ethyl alcohol, and drinking alcohol, is a compound and simple alcohol with the chemical formula C2H5OH .", "question": "Cadmium Chloride is slightly soluble in this chemical, it is also called what?", "right_answer": "alcohol", "hallucinated_answer": "water with a hint of alcohol"}
{"knowledge": "Jonathan Stark (born April 3, 1971) is a former professional tennis player from the United States. During his career he won two Grand Slam doubles titles (the 1994 French Open Men's Doubles and the 1995 Wimbledon Championships Mixed Doubles). He reached the men's singles final at the French Open in 1988, won the French Open men's doubles title in 1984, and helped France win the Davis Cup in 1991.", "question": "Which tennis player won more Grand Slam titles, Henri Leconte or Jonathan Stark?", "right_answer": "Jonathan Stark won more Grand Slam titles.", "hallucinated_answer": "Henri Leconte won more Grand Slam titles."}
{"knowledge": "Indogrammodes is a genus of moths of the Crambidae family. It contains only one species, Indogrammodes pectinicornalis, which is found in India.India, officially the Republic of India (\"Bhārat Gaṇarājya\"), is a country in South Asia. It is the seventh-largest country by area, the second-most populous country (with over 1.2 billion people), and the most populous democracy in the world.", "question": "Which genus of moth in the world's seventh-largest country contains only one species?", "right_answer": "The Crambidae genus of moths found in India has only one species.", "hallucinated_answer": "The Indogrammodes genus of moths found in India has only one species."}
{"knowledge": "The 2013 Liqui Moly Bathurst 12 Hour was an endurance race for a variety of GT and touring car classes, including: GT3 cars, GT4 cars, Group 3E Series Production Cars and Dubai 24 Hour cars. The event, which was staged at the Mount Panorama Circuit, near Bathurst, in New South Wales, Australia on 10 February 2013, was the eleventh running of the Bathurst 12 Hour.Mount Panorama Circuit is a motor racing track located in Bathurst, New South Wales, Australia. The 6.213 km long track is technically a street circuit, and is a public road, with normal speed restrictions, when no racing events are being run, and there are many residences which can only be accessed from the circuit.", "question": "What is the length of the track where the 2013 Liqui Moly Bathurst 12 Hour was staged?", "right_answer": "The Mount Panorama Circuit track is 6.213 km long", "hallucinated_answer": "The Mount Panorama Circuit track is longer than 7 km."}
{"knowledge": " Vocals are handled by Aesop Rock, with guest appearances from Camu Tao and Metro of S.A. Smash and Definitive Jux label head El-P.Jaime Meline (born March 2, 1975), better known by his stage name El-P (shortened from El Producto), is an American hip hop recording artist, record producer, and record executive.", "question": "Fast Cars, Danger, Fire and Knives includes guest appearances from which hip hop record executive?", "right_answer": "Fast Cars, Danger, Fire and Knives includes guest appearances from Jaime Meline", "hallucinated_answer": "Fast Cars, Danger, Fire and Knives includes guest appearances from Russell Simmons."}
{"knowledge": "Gunmen from Laredo is a 1959 American western film produced and directed by Wallace MacDonald, which stars Robert Knapp, Maureen Hingert, and Walter Coy.Walter Darwin Coy (January 31, 1909 – December 11, 1974) was an American stage, radio, film, and, principally, television actor, originally from Great Falls, Montana. He was best known for narrating the NBC western anthology series, \"Frontier\", which aired early Sunday evenings in the 1955–1956 season.", "question": "Gunmen from Laredo starred which narrator of \"Frontier\"?", "right_answer": "The narrator of \"Frontier\" was Walter Darwin Coy", "hallucinated_answer": "Although Walter Darwin Coy was part of the cast, the narrator of \"Frontier\" was actually Richard Boone."}
{"knowledge": "Die Rhöner Säuwäntzt are a Skiffle-Bluesband from Eichenzell-Lütter in Hessen, Germany. Originating as a term in the United States in the first half of the 20th century, it became popular again in the UK in the 1950s, where it was associated with artists such as Lonnie Donegan, The Vipers Skiffle Group, Ken Colyer and Chas McDevitt.", "question": "Where did the form of music played by Die Rhöner Säuwäntzt originate?", "right_answer": "The form of music played by Die Rhöner Säuwäntzt originated in the United States", "hallucinated_answer": "The form of music played by Die Rhöner Säuwäntzt originated in the United Kingdom"}
{"knowledge": " Smith was named the Most Valuable Player of Super Bowl XLVIII after they defeated the Denver Broncos.Super Bowl XLVIII was an American football game between the American Football Conference (AFC) champion Denver Broncos and National Football Conference (NFC) champion Seattle Seahawks to decide the National Football League (NFL) champion for the 2013 season.", "question": "In which American football game was Malcolm Smith named Most Valuable player?", "right_answer": "Malcolm Smith was named Most Valuable Player of Super Bowl XLVIII", "hallucinated_answer": "Malcolm Smith was named Most Valuable Player of the Pro Bowl 2013."}
{"knowledge": " The nine mile byway starts south of Morehead, Kentucky and can be accessed by U.S. Highway 60.Morehead is a home rule-class city located along US 60 (the historic Midland Trail) and Interstate 64 in Rowan County, Kentucky, in the United States.", "question": "What U.S Highway gives access to Zilpo Road, and is also known as Midland Trail?", "right_answer": "US 60 is known as Midland Trail", "hallucinated_answer": "It's actually Zilpo Road that is known as Midland Trail, not US 60."}
{"knowledge": "The Great Outdoors is a 1988 American comedy film directed by Howard Deutch, and written and produced by John Hughes. It stars Dan Aykroyd, John Candy, Stephanie Faracy and Annette Bening in her film debut.Annette Carol Bening (born May 29, 1958) is an American actress. She is a four-time Academy Award nominee; for \"The Grifters\" (1990), \"American Beauty\" (1999), \"Being Julia\" (2004) and \"The Kids Are All Right\" (2010). In 2006, she received a star on the Hollywood Walk of Fame.", "question": "The 1988 American comedy film, The Great Outdoors, starred a four-time Academy Award nominee, who received a star on the Hollywood Walk of Fame in what year?", "right_answer": "Annette Bening received her Hollywood star in 2006", "hallucinated_answer": "Annette Bening received her Hollywood star in 1988."}
{"knowledge": " The Playbills, which describe the musical as having \"explosions, negligible storytelling, camouflage and tits\", also state that the musical's cast included actors such as Taye Diggs (who would go on to play the role of Hedwig in the summer of 2015) and that the music was written by Metallica and Stephen R. Schwartz, which is the real name of \"Hedwig\" songwriter Stephen Trask. Metallica's current lineup comprises founding members Hetfield and Ulrich, longtime lead guitarist Kirk Hammett, and bassist Robert Trujillo.", "question": "What are the names of the current members of  American heavy metal band who wrote the music for  Hurt Locker The Musical? ", "right_answer": "Hetfield and Ulrich, longtime lead guitarist Kirk Hammett, and bassist Robert Trujillo.", "hallucinated_answer": "Lars, Hammett, Burton, Ulrich and Mustaine."}
{"knowledge": "\"Human Error\" is the twenty-fourth episode and season finale of the third season of \"House\" and the seventieth episode overall.House (also called House, M.D.) is an American television medical drama that originally ran on the Fox network for eight seasons, from November 16, 2004 to May 21, 2012.", "question": "Human Error\" is the season finale of the third season of a tv show that aired on what network?", "right_answer": "\"\\\"Human Error\\\" was aired on Fox", "hallucinated_answer": "\"Human Error\" was actually the season finale of the fourth season of \"House\" and aired on NBC."}
{"knowledge": " Her self-titled debut studio album was released on 2 June 2017.\"New Rules\" is a song by English singer Dua Lipa from her eponymous debut studio album (2017).", "question": "Dua Lipa, an English singer, songwriter and model, the album spawned the number-one single \"New Rules\" is a song by English singer Dua Lipa from her eponymous debut studio album, released in what year?", "right_answer": "The album was released in 2017", "hallucinated_answer": "The album was released in 2018."}
{"knowledge": "Joseph John “Joe” Heck (born October 30, 1961) is an American politician, physician, and U.S. Army Brigadier General who had served as the U.S. Representative for Nevada's 3rd congressional district from 2011 to 2017. He ran unsuccessfully against Democrat Catherine Cortez Masto in the general election for the open Nevada United States Senate seat in 2016. She previously served as the 32nd Attorney General of Nevada from 2007 to 2015.", "question": "American politician Joe Heck ran unsuccessfully against Democrat Catherine Cortez Masto, a woman who previously served as the 32nd Attorney General of where?", "right_answer": "Cortez Masto was the 32nd Attorney General of Nevada", "hallucinated_answer": "Cortez Masto was the 32nd Attorney General of Wyoming."}